# % 取模，返回除法的余数
# // 取整数，返回商的整数部分　　
# ** 幂 返回a的b次幂
# & 与运算；
# | 或运算；
# ^ 异或运算
# ~ 取反运算
# << 左移动运算符，位数足够的情况下，左移一位乘以2，左移两位乘以2的2次方，左移三位乘以2的3次方
# >> 右移动运算符，位数足够的情况下，右移一位除以2，右移两位除以2的2次方，右移三位除以2的3次方
#
# and 与运算
# or 或运算
# not 非运算

i1 = 5 % 3
print("Result : 5 %% 3 = %d" % (i1))  # result = 2

i2 = 11 // 2
print("Result : 11 // 2 = %d" % i2)     # 获得商 = 5,  如果整除，就是最后的值

i2 = 2 ** 3
print("Result : 2 * 2 * 2 = %d" % i2) # result = 8

i2 = 2 & 4
print("Result : 2 & 4 = %d" % i2)     # result = 6

i2 = 2 | 4
print("Result : 2 | 4 = %d" % i2)     # result = 6

i2 = ~2
print("Result : ~2 = %d" % i2)     # result ~0 = -1; ~1 = -2; ~2 = -3


